In [1]:
import pandas as pd
import numpy as np

In [2]:
test = pd.read_csv('Desktop/orgadatostp2/datos_navent_fiuba/test_final_100k.csv')
test.head()

   id  idaviso idpostulante
0   0   739260       6M9ZQR
1   1   739260       6v1xdL
2   2   739260       ezRKm9
3   3   758580       1Q35ej
4   4   758580       EAN4J6

In [3]:
vistas = pd.read_csv('Desktop/orgadatostp2/datos_procesados/vistas.csv')
vistas = vistas.drop(['timestamp'], axis = 1).rename({'idAviso': 'visitados'}, axis = 1)
vistas.head()

    visitados idpostulante
0  1111780242      YjVJQ6Z
1  1112263876      BmVpYoR
2  1112327963      wVkBzZd
3  1112318643      OqmP9pv
4  1111903673      DrpbXDP

In [4]:
test1 = pd.merge(test,vistas, on='idpostulante', how='left')
test1.head()

   id  idaviso idpostulante     visitados
0   0   739260       6M9ZQR  1.112448e+09
1   0   739260       6M9ZQR  1.112448e+09
2   0   739260       6M9ZQR  1.112464e+09
3   0   739260       6M9ZQR  1.112418e+09
4   0   739260       6M9ZQR  1.112461e+09

In [5]:
len(test1)

7759575

In [6]:
test1 = test1[test1['idaviso'] == test1['visitados']]

In [7]:
len(test1)

67659

In [8]:
test1 = test1.drop_duplicates()

In [9]:
len(test1)

34161

In [10]:
test1.head()

        id     idaviso idpostulante     visitados
19529  594    17903700      Yj5q3xX  1.790370e+07
19625  595    17903700      RzrDJlZ  1.790370e+07
20761  609  1000139175      LNKrDLr  1.000139e+09
21010  610  1000139175       exv4B8  1.000139e+09
21377  637  1000468151      jkMko3r  1.000468e+09

In [11]:
test1 = test1.drop(['id','idaviso'],axis=1)
test1.head()

      idpostulante     visitados
19529      Yj5q3xX  1.790370e+07
19625      RzrDJlZ  1.790370e+07
20761      LNKrDLr  1.000139e+09
21010       exv4B8  1.000139e+09
21377      jkMko3r  1.000468e+09

In [12]:
test1 = test1.rename({'visitados':'idaviso'}, axis =1)
test1.head()

      idpostulante       idaviso
19529      Yj5q3xX  1.790370e+07
19625      RzrDJlZ  1.790370e+07
20761      LNKrDLr  1.000139e+09
21010       exv4B8  1.000139e+09
21377      jkMko3r  1.000468e+09

In [13]:
test.head()

   id  idaviso idpostulante
0   0   739260       6M9ZQR
1   1   739260       6v1xdL
2   2   739260       ezRKm9
3   3   758580       1Q35ej
4   4   758580       EAN4J6

In [14]:
test_f = pd.merge(test,test1, on=['idaviso','idpostulante'], how='left', indicator = 'visitado')
test_f.head()

   id idaviso idpostulante   visitado
0   0  739260       6M9ZQR  left_only
1   1  739260       6v1xdL  left_only
2   2  739260       ezRKm9  left_only
3   3  758580       1Q35ej  left_only
4   4  758580       EAN4J6  left_only

In [15]:
test_f['visitado'].value_counts()

left_only     65839
both          34161
right_only        0
Name: visitado, dtype: int64

In [16]:
test_f['visitado'] = test_f['visitado'].map(lambda x: 1 if x=='both' else 0)
test_f.head()

   id idaviso idpostulante  visitado
0   0  739260       6M9ZQR         0
1   1  739260       6v1xdL         0
2   2  739260       ezRKm9         0
3   3  758580       1Q35ej         0
4   4  758580       EAN4J6         0

In [17]:
test_f['visitado'].value_counts()

0    65839
1    34161
Name: visitado, dtype: int64

In [18]:
test_f.to_csv('Desktop/orgadatostp2/avisos_vistos_feature.csv', index=False)